Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Modify Method
 Modifies the material in material database that has the same name as this instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Modify()
Public Function Modify As Boolean
Return Value
Type: Boolean
 True on success. False if operation failed. Possible reasons: a material with the name of this does not exist in database.
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace